{
    "intents": [
    {
    "patterns": ["Hi", "Hello", "Hey", "Greetings", "Good morning"],
    "responses": ["Hello, how can I help you today?"]
    },
    {
    "patterns": ["Goodbye", "Bye", "See you later", "Take care"],
    "responses": ["Goodbye!", "See you later!", "Have a great day!", "Take care!"]
    },
    {
    "patterns": ["Thank you", "Thanks a lot", "Appreciate it"],
    "responses": ["You're welcome!", "No problem!", "Glad I could help!"]
    },
    {
    "patterns": ["Can you help me?", "I need assistance", "What can you do?"],
    "responses": ["Of course! I'm here to help.", "How can I assist you?", "I'll do my best to help you."]
    },
    {
    "patterns": ["What is the price of the property?", "How much does it cost?", "What's the price range?"],
    "responses": ["The price of the property varies depending on the location and features. Can you provide more details?"]
    },
    {
    "patterns": ["How many bedrooms does the property have?", "Tell me about the bedrooms", "Number of bedrooms?"],
    "responses": ["The property has multiple bedrooms. Do you have a specific bedroom count in mind?"]
    },
    {
    "patterns": ["How many bathrooms does the property have?", "Tell me about the bathrooms", "Number of bathrooms?"],
    "responses": ["The property has multiple bathrooms. Is there a specific bathroom count you're interested in?"]
    },
    {
    "patterns": ["What is the square footage of the living area?", "Tell me about the living space", "Living area size?"],
    "responses": ["The property has a certain square footage of living space. Would you like more details?"]
    },
    {
    "patterns": ["What is the size of the lot?", "Tell me about the lot size", "Lot area?"],
    "responses": ["The property sits on a specific lot size. Do you have any preferences for the lot area?"]
    },
    {
    "patterns": ["How many floors does the property have?", "Tell me about the floors", "Number of floors?"],
    "responses": ["The property has multiple floors. Is there a particular floor count you're looking for?"]
    },
    {
    "patterns": ["Does the property have waterfront access?", "Tell me about the waterfront", "Waterfront view?"],
    "responses": ["The property's waterfront access can vary. Would you like more information about this feature?"]
    },
    {
    "patterns": ["What is the condition of the property?", "Tell me about the property's condition", "Is it in good condition?"],
    "responses": ["The condition of the property can vary. Can you provide more information about your expectations for the property's condition?"]
    },
    {
    "patterns": ["What is the grade of the property?", "Tell me about the property's grade", "How is it rated?"],
    "responses": ["The property is assigned a grade based on various factors. Can you provide more details or specific requirements for the property's grade?"]
    },
    {
    "patterns": ["What is the square footage of the above-ground area?", "Tell me about the above-ground space", "Above-ground area size?"],
    "responses": ["The property has a certain square footage of above-ground space. Would you like more information about this area?"]
    },
    {
    "patterns": ["What is the square footage of the basement?", "Tell me about the basement space", "Basement area size?"],
    "responses": ["The property has a certain square footage of basement space. Do you have any specific requirements or preferences for the basement area?"]
    },
    {
    "patterns": ["When was the property built?", "Tell me about the year of construction", "Construction year?"],
    "responses": ["The property was built in a specific year. Is there a particular range or era you're interested in?"]
    },
    {
    "patterns": ["Has the property been renovated?", "Tell me about any renovations", "Renovation history?"],
    "responses": ["The property may have undergone renovations at some point. Do you have any specific questions or preferences regarding renovations?"]
    },
    {
    "patterns": ["What is the square footage of the living area (comparing with 15 nearest neighbors)?", "Tell me about the living space (compared to neighbors)", "Living area size compared to neighbors?"],
    "responses": ["The property has a certain square footage of living space compared to its 15 nearest neighbors. Would you like more information about this comparison?"]
    },
    {
    "patterns": ["What is the size of the lot (comparing with 15 nearest neighbors)?", "Tell me about the lot size (compared to neighbors)", "Lot area compared to neighbors?"],
    "responses": ["The property sits on a specific lot size compared to its 15 nearest neighbors. Do you have any preferences for the lot area in comparison to the neighbors?"]
    }
  ]
}